package class01;

public class Thread_01 {

    /****
     * 多线程，并发  概念
     *
     *  1,多线程：
     *  就是让程序可以同时做多件事,
     *  站在用户角度
     *    多线程能带来更优质的体验
     *    功能的多样性和更快的响应速度
     * 站在硬件的角度
     *         多线程能  更好的发挥cpu(多核/多线程)的能力
     *
     *
     *
     *
     *  2, 并发：
     *    逻辑上多个线程一起运行，实际上某个时刻只有一个线程在执行的现象 就叫并发
     *  并发 是程序上的逻辑概念
     *  并发是物理上的概念
     *   如果程序是采用多线程的技术编写的
     *   那么运行在单核单线程的机器上，就会并发执行
     *   运行在多核/多线程的机器上 就会并行执行
     *
     * 程序员一般并心的是<并发>，程序可不可以并行，那就是操作系统和硬件决定的
     *
     */
}
